export const tableData = [
  // {
  //   type: "TEAM_RESULTS",
  //   header: {
  //     headerLine: "Міністерство молоді та спорту України\nФедерація пожежно-прикладного спорту України",
  //     subLine: "Чемпіонат України з пожежно-прикладного спорту\nу приміщеннях (жінки), III ранг",
  //     protocolLine: "Протокол",
  //     subProtocolLine: "командних результатів у підійманні штурмовою драбиною\nна 2-й поверх навчальної башти",
  //     date: "20-23 червня 2023 року",
  //     location: "м. Івано-Франківськ",
  //   },
  //   tables: [
  //     {
  //       rowBetween: Array(1).fill({
  //         columns: [
  //           {
  //           one: "1",
  //           two: "2",
  //           three: "3",
  //           four: "4",
  //           five: "5",
  //           six: "6",
  //           seven: "7",
  //           eight: "8",
  //           nine: "9",
  //           ten: "10",
  //           eleven: "11",
  //           twelve: "12",
  //           }
  //         ],
  //       }),
  //       head: {
  //         locationHeader: "Місце",
  //         teamHeader: "Команда",
  //         totalHeader: "Загальна сума місць",
  //         unitedHeader: "Спортивні дисципліни",
  //         columns: [
  //           "100-метрова смуга з перешкодами",
  //           "Підіймання штурмовою драбиною",
  //           "Двоборство"
  //         ],
  //       },
  //       rows: Array(18).fill({
  //         teamNumber: "1",
  //         teamName: "Kyiv",
  //         teamTotals: "6",
  //         columns: [
  //           {
  //             time: "13.3",
  //             zks: "0",
  //             position: "1",
  //           },
  //           {
  //             time: "13.3",
  //             zks: "0",
  //             position: "1",
  //           },
  //           {
  //             time: "13.3",
  //             zks: "0",
  //             position: "1",
  //           },
  //         ],
  //       }),
  //     },
  //   ],
  //   judges: [
  //     {
  //       title: "Головний суддя змаганнь,\nсуддя міжнародної категорії",
  //       name: "Ігор УЩАПІВСЬКИЙ",
  //     },
  //     {
  //       title: `Головний секретар змаганнь,\nсуддя міжнародної категорії`,
  //       name: "Зіновій КАРАПІНКА",
  //     },
  //     {
  //       title: `Суддя - інспектор змаганнь,\nсуддя національної категорії`,
  //       name: "Олександр ТАРАСОВ",
  //     },
  //   ],
  // },
  {
    type: "PERSONAL_RESULTS_HALFFINAL",
    header: {
      headerLine:
        "Міністерство молоді та спорту України \n Федерація пожежно-прикладного спорту України",
      subLine: "Чемпіонат України з пожежно-прикладного спорту жінки III ранг",
      protocolLine: "СТАРТОВИЙ ПРОТОКОЛ",
      subProtocolLine:
        "Особистих результатів у підійманні штурмовою драбиною \n на 2й поверх навчальної башти",
      date: "20 червня 2023 року",
      location: "м. Івано-Франківськ",
      track: "покриття бігової доріжки - рездор",
      metrics: "вид хронометражу - електронний",
    },
    tables: [
      {
        nameFirstSemi: "Перший півфінальний забіг",
        nameSecondSemi: "Другий півфінальний забіг",
        nameFinal: "Фінальний забіг",
        head: {
          zresult: "Заліковий результат",
          location: "місце",
          time: "час",
          track: "№ доріжки",
          number: "№ учасника",
          qualification: "Спортивна кваліфікація",
          initials: "Імя та призвіще",
          bday: "Рік народження",
          team: "Команда",
          results: "Результат",
        },
        row1: Array(5).fill({
          location: "1",
          time: "0.0",
          track: "45",
          number: "2",
          qualification: "Аматор",
          initials: "Bobby there",
          bday: "1993",
          team: "Some team",
          results: "Some results",
        }),
        row2: Array(10).fill({
          location: "2",
          time: "0.0",
          track: "55",
          number: "2",
          qualification: "Аматор",
          initials: "Bobby there",
          bday: "1993",
          team: "Some team",
          results: "Some results",
        }),
        row3: Array(4).fill({
          location: "3",
          time: "0.0",
          track: "4",
          number: "2",
          qualification: "Аматор",
          initials: "Bobby there",
          bday: "1993",
          team: "Some team",
          results: "Some results",
        }),
      },
    ],
    judges: [
      {
        title: "Головний суддя змаганнь, \nсуддя міжнародної категорії",
        name: "Ігор Ущапівський",
      },
      {
        title: `Головний секретар змаганнь, \nсуддя міжнародної категорії`,
        name: "Зіновій Карапінка",
      },
      {
        title: `Старший суддя, \nсуддя міжнародної категорії`,
        name: "Володимир Новгородченко",
      },
    ],
  },
  // {
  //   type: "PERSONAL_RESULTS_ZALIK",
  //   header: {
  //     headerLine:
  //       "Міністерство молоді та спорту України \n Федерація пожежно-прикладного спорту України",
  //     subLine: "Чемпіонат України з пожежно-прикладного спорту жінки III ранг",
  //     protocolLine: "Протокол",
  //     subProtocolLine:
  //       "Особистих результатів у підійманні штурмовою драбиною \n на 2й поверх навчальної башти",
  //     date: "20 червня 2023 року",
  //     location: "м. Івано-Франківськ",
  //     track: "покриття бігової доріжки - рездор",
  //     metrics: "вид хронометражу - електронний",
  //   },
  //   tables: [
  //     {
  //       name: "Залікові забіги",
  //       head: {
  //         location: "Місце",
  //         number: "№ Учасника",
  //         initials: "Імя та призвіще",
  //         bday: "Рік народження",
  //         team: "Команда",
  //         first: "Перша спроба",
  //         second: "Друга спроба",
  //         final: "Третя спроба",
  //         results: "Результати",
  //       },
  //       rows: Array(15).fill({
  //         location: "1",
  //         number: "2",
  //         initials: "Bobby there",
  //         bday: "1993",
  //         team: "Some team",
  //         first: "11.5",
  //         second: "12.5",
  //         final: "12.5",
  //       }),
  //     },
  //   ],
  //   judges: [
  //     {
  //       title: "Головний суддя змаганнь, \nсуддя міжнародної категорії",
  //       name: "Ігор Ущапівський",
  //     },
  //     {
  //       title: `Головний секретар змаганнь, \nсуддя міжнародної категорії`,
  //       name: "Зіновій Карапінка",
  //     },
  //     {
  //       title: `Старший суддя, \nсуддя міжнародної категорії`,
  //       name: "Володимир Новгородченко",
  //     },
  //   ],
  // },
  // {
  //   type: "PERSONAL_RESULTS_FINAL_100",
  //   header: {
  //     headerLine:
  //       "Міністерство молоді та спорту України \n Федерація пожежно-прикладного спорту України",
  //     subLine: "Чемпіонат України з пожежно-прикладного спорту жінки III ранг",
  //     protocolLine: "Протокол",
  //     subProtocolLine:
  //       "особистих результатів \n з подолання 100м смуги з перешкодами",
  //     date: "20 червня 2023 року",
  //     location: "м. Івано-Франківськ",
  //     track: "покриття бігової доріжки - рездор",
  //     metrics: "вид хронометражу - електронний",
  //   },
  //   tables: [
  //     {
  //       nameFinal: "ФІНАЛЬНИЙ ЗАБІГ",
  //       nameSemiFinal: "ПІВФІНАЛЬНІ ЗАБІГИ",
  //       nameZalik: "ЗАЛІКОВІ ЗАБІГИ",
  //       headFinals: {
  //         location: "Місце",
  //         number: "№ учасника",
  //         qualification: "Спортивна кваліфікація",
  //         initials: "Ім'я та прізвище",
  //         bday: "Рік народження",
  //         team: "Команда",
  //         results: "Результат",
  //       },
  //       headZalik: {
  //         location: "Місце",
  //         number: "№ учасника",
  //         initials: "Ім'я та прще",
  //         bday: "Рік народження",
  //         team: "Команда",
  //         first: "1-ша спроба",
  //         second: "2-ша спроба",
  //         final: "краща спроба",
  //         results: "Результати",
  //         before: "до змагань",
  //         after: "після змагань",
  //         qualification: "Спортивна кваліфікація",
  //       },
  //       rowsFinal: Array(4).fill({
  //         location: "1",
  //         number: "2",
  //         qualification: "МСМК",
  //         initials: "Bobby there",
  //         bday: "1993",
  //         team: "Some team",
  //         results: "Some results",
  //         before: "before",
  //         after: "after",
  //       }),
  //       rowsSemiFinal: Array(4).fill({
  //         location: "3",
  //         number: "4",
  //         qualification: "МСМК",
  //         initials: "Bobby there 2",
  //         bday: "1993",
  //         team: "Some team",
  //         results: "Some results",
  //         before: "before",
  //         after: "after",
  //       }),
  //       rowsZalik: Array(15).fill({
  //         location: "1",
  //         number: "2",
  //         initials: "Bobby there",
  //         bday: "1993",
  //         team: "Some team",
  //         first: "11.5",
  //         second: "12.5",
  //         final: "12.5",
  //         before: "before",
  //         after: "after",
  //       }),
  //     },
  //   ],
  //   judges: [
  //     {
  //       title: "Головний суддя змаганнь, \nсуддя міжнародної категорії",
  //       name: "Ігор УЩАПІВСЬКИЙ",
  //     },
  //     {
  //       title: `Головний секретар змаганнь, \nсуддя міжнародної категорії`,
  //       name: "Зіновій КАРАПІНКА",
  //     },
  //     {
  //       title: `Старший суддя, \nсуддя міжнародної категорії`,
  //       name: "Володимир НОВГОРОДЧЕНКО",
  //     },
  //   ],
  // },
  // {
  //   type: "PERSONAL_RESULTS_HALFFINAL_100",
  //   header: {
  //     headerLine:
  //       "Міністерство молоді та спорту України \n Федерація пожежно-прикладного спорту України",
  //     subLine: "Чемпіонат України з пожежно-прикладного спорту жінки III ранг",
  //     protocolLine: "Протокол",
  //     subProtocolLine:
  //       "Особистих результатів \n з подолання 100м смуги з перешкодами",
  //     date: "20 червня 2023 року",
  //     location: "м. Івано-Франківськ",
  //     track: "покриття бігової доріжки - рездор",
  //     metrics: "вид хронометражу - електронний",
  //   },
  //   tables: [
  //     {
  //       name: "ПівФінальні забіги",
  //       head: {
  //         location: "Місце",
  //         number: "№ Учасника",
  //         initials: "Імя та призвіще",
  //         bday: "Рік народження",
  //         team: "Команда",
  //         results: "Результати",
  //         before: "до змаганнь",
  //         after: "після змаганнь",
  //         category: "Розряд",
  //       },
  //       rows: Array(8).fill({
  //         location: "1",
  //         number: "2",
  //         initials: "Bobby there",
  //         bday: "1993",
  //         team: "Some team",
  //         results: "Some results",
  //         before: "before",
  //         after: "after",
  //       }),
  //     },
  //   ],
  //   judges: [
  //     {
  //       title: "Головний суддя змаганнь, \nсуддя міжнародної категорії",
  //       name: "Ігор Ущапівський",
  //     },
  //     {
  //       title: `Головний секретар змаганнь, \nсуддя міжнародної категорії`,
  //       name: "Зіновій Карапінка",
  //     },
  //     {
  //       title: `Старший суддя, \nсуддя міжнародної категорії`,
  //       name: "Володимир Новгородченко",
  //     },
  //   ],
  // },
  // {
  //   type: "PERSONAL_RESULTS_ZALIK_100",
  //   header: {
  //     headerLine:
  //       "Міністерство молоді та спорту України \n Федерація пожежно-прикладного спорту України",
  //     subLine: "Чемпіонат України з пожежно-прикладного спорту жінки III ранг",
  //     protocolLine: "Протокол",
  //     subProtocolLine:
  //       "Особистих результатів \n з подолання 100м смуги з перешкодами",
  //     date: "20 червня 2023 року",
  //     location: "м. Івано-Франківськ",
  //     track: "покриття бігової доріжки - рездор",
  //     metrics: "вид хронометражу - електронний",
  //   },
  //   tables: [
  //     {
  //       name: "Залікові забіги",
  //       head: {
  //         location: "Місце",
  //         number: "№ Учасника",
  //         initials: "Імя та призвіще",
  //         bday: "Рік народження",
  //         team: "Команда",
  //         first: "Перша спроба",
  //         second: "Друга спроба",
  //         final: "Краща спроба",
  //         results: "Результати",
  //         before: "до змаганнь",
  //         after: "після змаганнь",
  //         category: "Розряд",
  //       },
  //       rows: Array(15).fill({
  //         location: "1",
  //         number: "2",
  //         initials: "Bobby there",
  //         bday: "1993",
  //         team: "Some team",
  //         first: "11.5",
  //         second: "12.5",
  //         final: "12.5",
  //         before: "before",
  //         after: "after",
  //       }),
  //     },
  //   ],
  //   judges: [
  //     {
  //       title: "Головний суддя змаганнь, \nсуддя міжнародної категорії",
  //       name: "Ігор Ущапівський",
  //     },
  //     {
  //       title: `Головний секретар змаганнь, \nсуддя міжнародної категорії`,
  //       name: "Зіновій Карапінка",
  //     },
  //     {
  //       title: `Старший суддя, \nсуддя міжнародної категорії`,
  //       name: "Володимир Новгородченко",
  //     },
  //   ],
  // },
  // {
  //   type: "TEAM_RESULTS_BY_TYPE",
  //   header: {
  //     headerLine:
  //       "Міністерство молоді та спорту України \n Федерація пожежно-прикладного спорту України",
  //     subLine: "Чемпіонат України з пожежно-прикладного спорту жінки III ранг",
  //     protocolLine: "Протокол",
  //     subProtocolLine:
  //       "Командних результатів у підійманні штурмовою драбиною \n на 2й поверх навчальної башти",
  //     date: "20 червня 2023 року",
  //     location: "м. Івано-Франківськ",
  //     track: "покриття бігової доріжки - рездор",
  //     metrics: "вид хронометражу - електронний",
  //   },
  //   tables: [
  //     {
  //       head: {
  //         number: "Номер",
  //         team: "Команда",
  //         initials: "Імя та призвіще",
  //         bday: "Рік народження",
  //         result: "Результат",
  //         sum: "Сума часу",
  //       },
  //       rows: Array(15).fill({
  //         number: "2",
  //         team: {
  //           name: "Чернівецька область",
  //           others: "поза заліком",
  //           participants: [
  //             {
  //               initials: "Наталія Маньякова",
  //               bday: "1999",
  //               result1: "7,72",
  //               result2: "7,75",
  //             },
  //             {
  //               initials: "Наталія TT",
  //               bday: "1998",
  //               result1: "7,72",
  //               result2: "7,75",
  //             },
  //           ],
  //           excluded: [
  //             {
  //               initials: "Наталія поза заліком",
  //               bday: "1998",
  //               result1: "7,72",
  //               result2: "XXX",
  //             },
  //           ],
  //         },
  //       }),
  //     },
  //   ],
  //   judges: [
  //     {
  //       title: "Головний суддя змаганнь, \nсуддя міжнародної категорії",
  //       name: "Ігор Ущапівський",
  //     },
  //     {
  //       title: `Головний секретар змаганнь, \nсуддя міжнародної категорії`,
  //       name: "Зіновій Карапінка",
  //     },
  //     {
  //       title: `Старший суддя, \nсуддя національної категорії`,
  //       name: "Олександр Черненко",
  //     },
  //   ],
  // },
  // {
  //   type: "TEAM_100_RESULTS",
  //   header: {
  //     headerLine:
  //       "Міністерство молоді та спорту України \n Федерація пожежно-прикладного спорту України",
  //     subLine: "Чемпіонат України з пожежно-прикладного спорту (жінки), III ранг",
  //     protocolLine: "Протокол",
  //     subProtocolLine:
  //       "Командних результатів у подоланні 100 метрової смуги з перешкодами",
  //     date: "21 червня 2023 року",
  //     location: "м. Івано-Франківськ",
  //     track: "покриття бігової доріжки - рездор",
  //     beginning: "початок - 11:15",
  //     metrics: "вид хронометражу - електронний",
  //   },
  //   tables: [
  //     {
  //       head: {
  //         location: "Місце",
  //         number: "№ учасника",
  //         team: "Команда",
  //         initials: "Ім'я та прізвище",
  //         bday: "Рік народження",
  //         result: "Результат",
  //         sum: "Сума часу",
  //         category: "Спортивна\nкваліфікація",
  //         before: "до\nзмагань",
  //         after: "після\nзмагань",
  //       },
  //       rows: Array(15).fill({
  //         location: "2",
  //         team: {
  //           name: "Чернівецька область",
  //           others: "поза заліком",
  //           participants: [
  //             {
  //               initials: "Наталія Крепінка",
  //               bday: "1999",
  //               result1: "7,72",
  //               result2: "7,75",
  //               before: "before",
  //               after: "after",
  //             },
  //             {
  //               initials: "Наталія Крепінка",
  //               bday: "1999",
  //               result1: "7,72",
  //               result2: "7,75",
  //               before: "before",
  //               after: "after",
  //             },
  //             {
  //               initials: "Наталія Крепінка",
  //               bday: "1999",
  //               result1: "7,72",
  //               result2: "7,75",
  //               before: "before",
  //               after: "after",
  //             },
  //             {
  //               initials: "Наталія TT",
  //               bday: "1998",
  //               result1: "7,72",
  //               result2: "7,75",
  //               before: "before",
  //               after: "after",
  //             },
  //           ],
  //           excluded: [
  //             {
  //               initials: "Наталія поза заліком",
  //               bday: "1995",
  //               result1: "7,72",
  //               result2: "XXX",
  //               before: "before",
  //               after: "after",
  //             },
  //           ],
  //         },
  //       }),
  //     },
  //   ],
  //   judges: [
  //     {
  //       title: "Головний суддя змаганнь, \nсуддя міжнародної категорії",
  //       name: "Ігор УЩАПІВСЬКИЙ",
  //     },
  //     {
  //       title: `Головний секретар змаганнь, \nсуддя міжнародної категорії`,
  //       name: "Зіновій КАРАПІНКА",
  //     },
  //   ],
  // },
  // {
  //   type: "DUELING_PERSONAL_RESULTS",
  //   header: {
  //     headerLine:
  //       "Міністерство молоді та спорту України \n Федерація пожежно-прикладного спорту України",
  //     subLine: "Чемпіонат України з пожежно-прикладного спорту жінки III ранг",
  //     protocolLine: "Протокол",
  //     subProtocolLine: "Особистих результатів у двоборстві",
  //     date: "20 червня 2023 року",
  //     location: "м. Івано-Франківськ",
  //     track: "покриття бігової доріжки - рездор",
  //     metrics: "вид хронометражу - електронний",
  //   },
  //   tables: [
  //     {
  //       head: {
  //         location: "Місце",
  //         number: "№ Учасника",
  //         initials: "Імя та призвіще",
  //         bday: "Рік народження",
  //         team: "Команда",
  //         columns: ["100м смуга", "штурмова драбина", "сума часу"],
  //       },
  //       rows: Array(35).fill({
  //         location: "1",
  //         number: "2",
  //         initials: "Bobby here and there",
  //         bday: "1993",
  //         team: "Some team",
  //         columns: ["55.2", "33.22", "44.2"],
  //       }),
  //     },
  //   ],
  //   judges: [
  //     {
  //       title: "Головний суддя змаганнь, \nсуддя міжнародної категорії",
  //       name: "Ігор Ущапівський",
  //     },
  //     {
  //       title: `Головний секретар змаганнь, \nсуддя міжнародної категорії`,
  //       name: "Зіновій Карапінка",
  //     },
  //     {
  //       title: `Старший суддя, \nсуддя міжнародної категорії`,
  //       name: "Павло Скуба",
  //     },
  //   ],
  // },
  // {
  //   type: "TEAM_RESULTS_BY_TYPE",
  //   header: {
  //     headerLine:
  //       "Міністерство молоді та спорту України \n Федерація пожежно-прикладного спорту України",
  //     subLine: "Чемпіонат України з пожежно-прикладного спорту жінки III ранг",
  //     protocolLine: "Протокол",
  //     subProtocolLine: "Командних результатів у двоборстві",
  //     date: "20-21 червня 2023 року",
  //     location: "м. Івано-Франківськ",
  //     track: "покриття бігової доріжки - рездор",
  //     metrics: "вид хронометражу - електронний",
  //   },
  //   tables: [
  //     {
  //       head: {
  //         number: "Номер",
  //         team: "Команда",
  //         initials: "Імя та призвіще",
  //         bday: "Рік народження",
  //         result: "Результат",
  //         sum: "Сума часу",
  //       },
  //       rows: Array(15).fill({
  //         number: "2",
  //         team: {
  //           name: "Чернівецька область",
  //           others: "поза заліком",
  //           participants: [
  //             {
  //               initials: "Наталія Крепінка",
  //               bday: "1999",
  //               result1: "7,72",
  //               result2: "7,75",
  //             },
  //             {
  //               initials: "Наталія TT",
  //               bday: "1998",
  //               result1: "7,72",
  //               result2: "7,75",
  //             },
  //           ],
  //           excluded: [
  //             {
  //               initials: "Наталія поза заліком",
  //               bday: "1995",
  //               result1: "7,72",
  //               result2: "XXX",
  //             },
  //           ],
  //         },
  //       }),
  //     },
  //   ],
  //   judges: [
  //     {
  //       title: "Головний суддя змаганнь, \nсуддя міжнародної категорії",
  //       name: "Ігор Ущапівський",
  //     },
  //     {
  //       title: `Головний секретар змаганнь, \nсуддя міжнародної категорії`,
  //       name: "Зіновій Карапінка",
  //     },
  //     {
  //       title: `Старший суддя, \nсуддя міжнародної категорії`,
  //       name: "Володимир Новгородченко",
  //     },
  //   ],
  // },
  // {
  //   type: "TEAM_RELAY_RESULTS",
  //   header: {
  //     headerLine:
  //       "Міністерство молоді та спорту України \n Федерація пожежно-прикладного спорту України",
  //     subLine: "Чемпіонат України з пожежно-прикладного спорту жінки III ранг",
  //     protocolLine: "Протокол",
  //     subProtocolLine:
  //       "Командних результатів з пожежної естафети 4 х 100 метрів",
  //     date: "22 червня 2023 року",
  //     location: "м. Івано-Франківськ",
  //     track: "покриття бігової доріжки - рездор",
  //     metrics: "вид хронометражу - електронний",
  //   },
  //   tables: [
  //     {
  //       head: {
  //         location: "Місце",
  //         team: "Команда",
  //         number: "№ Учасника",
  //         initials: "Імя та призвіще",
  //         bday: "Рік народження",
  //         first: "Перша спроба",
  //         second: "Друга спроба",
  //         final: "Кращий",
  //       },
  //       rows: Array(9).fill({
  //         location: "1",
  //         team: "Чернівецька область",
  //         first: "88",
  //         second: "86",
  //         final: "88",
  //         participants: [
  //           {
  //             number: "2",
  //             initials: "Наталія Крепінка df sdf sdfsd",
  //             bday: "1999",
  //           },
  //           {
  //             number: "3",
  //             initials: "Наталія GG",
  //             bday: "1996",
  //           },
  //           {
  //             number: "4",
  //             initials: "Наталія TT",
  //             bday: "1997",
  //           },
  //           {
  //             number: "5",
  //             initials: "Наталія VV",
  //             bday: "1995",
  //           },
  //         ],
  //       }),
  //     },
  //   ],
  //   judges: [
  //     {
  //       title: "Головний суддя змаганнь, \nсуддя міжнародної категорії",
  //       name: "Ігор УЩАПКІВСЬКИЙ",
  //     },
  //     {
  //       title: `Головний секретар змаганнь, \nсуддя міжнародної категорії`,
  //       name: "Зіновій КАРАПІНКА",
  //     },
  //   ],
  // },
  // {
  //   type: "START_PROTOCOL",
  //   header: {
  //     headerLine:
  //       "Міністерство молоді та спорту України \n Федерація пожежно-прикладного спорту України",
  //     subLine: "Чемпіонат України з пожежно-прикладного спорту (жінки), III ранг",
  //     protocolLine: "Стартовий протокол",
  //     subProtocolLine: "змаганнь з чогось там",
  //     date: "22 червня 2023 року",
  //     location: "м. Івано-Франківськ",
  //     // track: "покриття бігової доріжки - рездор",
  //     // metrics: "вид хронометражу - електронний",
  //   },
  //   tables: [
  //     {
  //       head: {
  //         records: "МС – 7.65; КМС – 7.95; І розряд – 8.25; ІІ розряд – 8.75; ІІІ розряд – 9.50\n",
  //         set: "№ забігу",
  //         track: "№ доріжки",
  //         team: "Команда",
  //         number: "№ учасника",
  //         initials: "Ім'я та призвіще",
  //         bday: "Рік народження",
  //         category: "Спортивна\nкваліфікація",
  //         results: "Результати",
  //         first: "перша \n спроба",
  //         second: "друга \n спроба",
  //         best: "краща \n спроба",
  //       },
  //       rows: Array(9).fill({
  //         set: "1",
  //         participants: [
  //           {
  //             track: "1",
  //             number: "2",
  //             initials: "Наталія Крепінка",
  //             bday: "1999",
  //             team: "Чернівецька область",
  //             category: "I",
  //             firstResult: "15.29",
  //             secondResult: "14.21",
  //             bestResult: "14.21",
  //           },
  //           {
  //             track: "2",
  //             number: "3",
  //             initials: "Наталія GG",
  //             bday: "1996",
  //             team: "Чернівецька область",
  //             category: "I",
  //             firstResult: "15.29",
  //             secondResult: "14.21",
  //             bestResult: "14.21",
  //           },
  //           {
  //             track: "3",
  //             number: "4",
  //             initials: "Наталія TT",
  //             bday: "1997",
  //             team: "Чернівецька область",
  //             category: "I",
  //             firstResult: "15.29",
  //             secondResult: "14.21",
  //             bestResult: "14.21",
  //           },
  //           {
  //             track: "4",
  //             number: "5",
  //             initials: "Наталія VV",
  //             bday: "1995",
  //             team: "Чернівецька область",
  //             category: "I",
  //             firstResult: "15.29",
  //             secondResult: "14.21",
  //             bestResult: "14.21",
  //           },
  //         ],
  //       }),
  //     },
  //   ],
  //   judges: [
  //     {
  //       title: `Головний секретар змаганнь, \nсуддя міжнародної категорії`,
  //       name: "Зіновій КАРАПІНКА",
  //     },
  //   ],
  // },
];
