export const tableData = [
  {
    type: "TEAM_RESULTS",
    header: {
      headerLine: "Міністерство молоді та спорту України\nФедерація пожежно-прикладного спорту України",
      subLine: "Чемпіонат України з пожежно-прикладного спорту\nу приміщеннях (жінки), III ранг",
      protocolLine: "Протокол",
      subProtocolLine: "командних результатів у підійманні штурмовою драбиною\nна 2-й поверх навчальної башти",
      date: "20-23 червня 2023 року",
      location: "м. Івано-Франківськ",
    },
    tables: [
      {
        head: {
          locationHeader: "Місце",
          teamHeader: "Команда",
          totalHeader: "Загальна сума місць",
          unitedHeader: "Спортивні дисципліни",
          columns: [
            "100-метрова смуга з перешкодами",
            "Підіймання штурмовою драбиною",
            "Двоборство",
            "Пожежна естафета",
          ],
        },
        rows: Array(18).fill({
          teamNumber: "1",
          teamName: "Kyiv",
          teamTotals: "6",
          columns: [
            {
              time: "13.3",
              position: "1",
            },
            {
              time: "13.3",
              position: "1",
            },
            {
              time: "13.3",
              position: "1",
            },
            {
              time: "13.3",
              position: "1",
            },
          ],
        }),
      },
    ],
    judges: [
      {
        title: "Головний суддя змаганнь,\nсуддя міжнародної категорії",
        name: "Ігор Ущапівський",
      },
      {
        title: `Головний секретар змаганнь,\nсуддя міжнародної категорії`,
        name: "Зіновій Карапінка",
      },
      {
        title: `Суддя - інспектор змаганнь,\nсуддя національної категорії`,
        name: "Володимир Чернецький",
      },
    ],
  },
  {
    type: "PERSONAL_RESULTS_FINAL",
    header: {
      headerLine:
        "Міністерство молоді та спорту України \n Федерація пожежно-прикладного спорту України",
      subLine: "Чемпіонат України з пожежно-прикладного спорту жінки III ранг",
      protocolLine: "Протокол",
      subProtocolLine:
        "Особистих результатів у підійманні штурмовою драбиною \n на 2й поверх навчальної башти",
      date: "20 червня 2023 року",
      location: "м. Івано-Франківськ",
      track: "покриття бігової доріжки - рездор",
      beginning: "початок - 11:15",
      metrics: "вид хронометражу - електронний",
    },
    tables: [
      {
        name: "Фінальний забіг",
        head: {
          location: "Місце",
          number: "№ Учасника",
          initials: "Імя та призвіще",
          bday: "Рік народження",
          team: "Команда",
          results: "Результати",
        },
        rows: Array(4).fill({
          location: "1",
          number: "2",
          initials: "Bobby there",
          bday: "1993",
          team: "Some team",
          results: "Some results",
        }),
      },
    ],
    judges: [
      {
        title: "Головний суддя змаганнь, \nсуддя міжнародної категорії",
        name: "Ігор Ущапівський",
      },
      {
        title: `Головний секретар змаганнь, \nсуддя міжнародної категорії`,
        name: "Зіновій Карапінка",
      },
      {
        title: `Старший суддя, \nсуддя міжнародної категорії`,
        name: "Володимир Новгородченко",
      },
    ],
  },
  {
    type: "PERSONAL_RESULTS_HALFFINAL",
    header: {
      headerLine:
        "Міністерство молоді та спорту України \n Федерація пожежно-прикладного спорту України",
      subLine: "Чемпіонат України з пожежно-прикладного спорту жінки III ранг",
      protocolLine: "Протокол",
      subProtocolLine:
        "Особистих результатів у підійманні штурмовою драбиною \n на 2й поверх навчальної башти",
      date: "20 червня 2023 року",
      location: "м. Івано-Франківськ",
      track: "покриття бігової доріжки - рездор",
      metrics: "вид хронометражу - електронний",
    },
    tables: [
      {
        name: "ПівФінальні забіги",
        head: {
          location: "Місце",
          number: "№ Учасника",
          initials: "Імя та призвіще",
          bday: "Рік народження",
          team: "Команда",
          results: "Результати",
        },
        rows: Array(8).fill({
          location: "1",
          number: "2",
          initials: "Bobby there",
          bday: "1993",
          team: "Some team",
          results: "Some results",
        }),
      },
    ],
    judges: [
      {
        title: "Головний суддя змаганнь, \nсуддя міжнародної категорії",
        name: "Ігор Ущапівський",
      },
      {
        title: `Головний секретар змаганнь, \nсуддя міжнародної категорії`,
        name: "Зіновій Карапінка",
      },
      {
        title: `Старший суддя, \nсуддя міжнародної категорії`,
        name: "Володимир Новгородченко",
      },
    ],
  },
  {
    type: "PERSONAL_RESULTS_ZALIK",
    header: {
      headerLine:
        "Міністерство молоді та спорту України \n Федерація пожежно-прикладного спорту України",
      subLine: "Чемпіонат України з пожежно-прикладного спорту жінки III ранг",
      protocolLine: "Протокол",
      subProtocolLine:
        "Особистих результатів у підійманні штурмовою драбиною \n на 2й поверх навчальної башти",
      date: "20 червня 2023 року",
      location: "м. Івано-Франківськ",
      track: "покриття бігової доріжки - рездор",
      metrics: "вид хронометражу - електронний",
    },
    tables: [
      {
        name: "Залікові забіги",
        head: {
          location: "Місце",
          number: "№ Учасника",
          initials: "Імя та призвіще",
          bday: "Рік народження",
          team: "Команда",
          first: "Перша спроба",
          second: "Друга спроба",
          final: "Третя спроба",
          results: "Результати",
        },
        rows: Array(15).fill({
          location: "1",
          number: "2",
          initials: "Bobby there",
          bday: "1993",
          team: "Some team",
          first: "11.5",
          second: "12.5",
          final: "12.5",
        }),
      },
    ],
    judges: [
      {
        title: "Головний суддя змаганнь, \nсуддя міжнародної категорії",
        name: "Ігор Ущапівський",
      },
      {
        title: `Головний секретар змаганнь, \nсуддя міжнародної категорії`,
        name: "Зіновій Карапінка",
      },
      {
        title: `Старший суддя, \nсуддя міжнародної категорії`,
        name: "Володимир Новгородченко",
      },
    ],
  },
  {
    type: "PERSONAL_RESULTS_FINAL_100",
    header: {
      headerLine:
        "Міністерство молоді та спорту України \n Федерація пожежно-прикладного спорту України",
      subLine: "Чемпіонат України з пожежно-прикладного спорту жінки III ранг",
      protocolLine: "Протокол",
      subProtocolLine:
        "Особистих результатів \n з подолання 100м смуги з перешкодами",
      date: "20 червня 2023 року",
      location: "м. Івано-Франківськ",
      track: "покриття бігової доріжки - рездор",
      metrics: "вид хронометражу - електронний",
    },
    tables: [
      {
        name: "Фінальний забіг",
        head: {
          location: "Місце",
          number: "№ Учасника",
          initials: "Імя та призвіще",
          bday: "Рік народження",
          team: "Команда",
          results: "Результати",
          before: "до змаганнь",
          after: "після змаганнь",
          category: "Розряд",
        },
        rows: Array(4).fill({
          location: "1",
          number: "2",
          initials: "Bobby there",
          bday: "1993",
          team: "Some team",
          results: "Some results",
          before: "before",
          after: "after",
        }),
      },
    ],
    judges: [
      {
        title: "Головний суддя змаганнь, \nсуддя міжнародної категорії",
        name: "Ігор Ущапівський",
      },
      {
        title: `Головний секретар змаганнь, \nсуддя міжнародної категорії`,
        name: "Зіновій Карапінка",
      },
      {
        title: `Старший суддя, \nсуддя міжнародної категорії`,
        name: "Володимир Новгородченко",
      },
    ],
  },
  {
    type: "PERSONAL_RESULTS_HALFFINAL_100",
    header: {
      headerLine:
        "Міністерство молоді та спорту України \n Федерація пожежно-прикладного спорту України",
      subLine: "Чемпіонат України з пожежно-прикладного спорту жінки III ранг",
      protocolLine: "Протокол",
      subProtocolLine:
        "Особистих результатів \n з подолання 100м смуги з перешкодами",
      date: "20 червня 2023 року",
      location: "м. Івано-Франківськ",
      track: "покриття бігової доріжки - рездор",
      metrics: "вид хронометражу - електронний",
    },
    tables: [
      {
        name: "ПівФінальні забіги",
        head: {
          location: "Місце",
          number: "№ Учасника",
          initials: "Імя та призвіще",
          bday: "Рік народження",
          team: "Команда",
          results: "Результати",
          before: "до змаганнь",
          after: "після змаганнь",
          category: "Розряд",
        },
        rows: Array(8).fill({
          location: "1",
          number: "2",
          initials: "Bobby there",
          bday: "1993",
          team: "Some team",
          results: "Some results",
          before: "before",
          after: "after",
        }),
      },
    ],
    judges: [
      {
        title: "Головний суддя змаганнь, \nсуддя міжнародної категорії",
        name: "Ігор Ущапівський",
      },
      {
        title: `Головний секретар змаганнь, \nсуддя міжнародної категорії`,
        name: "Зіновій Карапінка",
      },
      {
        title: `Старший суддя, \nсуддя міжнародної категорії`,
        name: "Володимир Новгородченко",
      },
    ],
  },
  {
    type: "PERSONAL_RESULTS_ZALIK_100",
    header: {
      headerLine:
        "Міністерство молоді та спорту України \n Федерація пожежно-прикладного спорту України",
      subLine: "Чемпіонат України з пожежно-прикладного спорту жінки III ранг",
      protocolLine: "Протокол",
      subProtocolLine:
        "Особистих результатів \n з подолання 100м смуги з перешкодами",
      date: "20 червня 2023 року",
      location: "м. Івано-Франківськ",
      track: "покриття бігової доріжки - рездор",
      metrics: "вид хронометражу - електронний",
    },
    tables: [
      {
        name: "Залікові забіги",
        head: {
          location: "Місце",
          number: "№ Учасника",
          initials: "Імя та призвіще",
          bday: "Рік народження",
          team: "Команда",
          first: "Перша спроба",
          second: "Друга спроба",
          final: "Краща спроба",
          results: "Результати",
          before: "до змаганнь",
          after: "після змаганнь",
          category: "Розряд",
        },
        rows: Array(15).fill({
          location: "1",
          number: "2",
          initials: "Bobby there",
          bday: "1993",
          team: "Some team",
          first: "11.5",
          second: "12.5",
          final: "12.5",
          before: "before",
          after: "after",
        }),
      },
    ],
    judges: [
      {
        title: "Головний суддя змаганнь, \nсуддя міжнародної категорії",
        name: "Ігор Ущапівський",
      },
      {
        title: `Головний секретар змаганнь, \nсуддя міжнародної категорії`,
        name: "Зіновій Карапінка",
      },
      {
        title: `Старший суддя, \nсуддя міжнародної категорії`,
        name: "Володимир Новгородченко",
      },
    ],
  },
  {
    type: "TEAM_RESULTS_BY_TYPE",
    header: {
      headerLine:
        "Міністерство молоді та спорту України \n Федерація пожежно-прикладного спорту України",
      subLine: "Чемпіонат України з пожежно-прикладного спорту жінки III ранг",
      protocolLine: "Протокол",
      subProtocolLine:
        "Командних результатів у підійманні штурмовою драбиною \n на 2й поверх навчальної башти",
      date: "20 червня 2023 року",
      location: "м. Івано-Франківськ",
      track: "покриття бігової доріжки - рездор",
      metrics: "вид хронометражу - електронний",
    },
    tables: [
      {
        head: {
          number: "Номер",
          team: "Команда",
          initials: "Імя та призвіще",
          bday: "Рік народження",
          result: "Результат",
          sum: "Сума часу",
        },
        rows: Array(15).fill({
          number: "2",
          team: {
            name: "Чернівецька область",
            others: "поза заліком",
            participants: [
              {
                initials: "Наталія Маньякова",
                bday: "1999",
                result1: "7,72",
                result2: "7,75",
              },
              {
                initials: "Наталія TT",
                bday: "1998",
                result1: "7,72",
                result2: "7,75",
              },
            ],
            excluded: [
              {
                initials: "Наталія поза заліком",
                bday: "1998",
                result1: "7,72",
                result2: "XXX",
              },
            ],
          },
        }),
      },
    ],
    judges: [
      {
        title: "Головний суддя змаганнь, \nсуддя міжнародної категорії",
        name: "Ігор Ущапівський",
      },
      {
        title: `Головний секретар змаганнь, \nсуддя міжнародної категорії`,
        name: "Зіновій Карапінка",
      },
      {
        title: `Старший суддя, \nсуддя національної категорії`,
        name: "Олександр Черненко",
      },
    ],
  },
  {
    type: "TEAM_100_RESULTS",
    header: {
      headerLine:
        "Міністерство молоді та спорту України \n Федерація пожежно-прикладного спорту України",
      subLine: "Чемпіонат України з пожежно-прикладного спорту жінки III ранг",
      protocolLine: "Протокол",
      subProtocolLine:
        "Командних результатів у подоланні 100 метрової смуги з перешкодами",
      date: "21 червня 2023 року",
      location: "м. Івано-Франківськ",
      track: "покриття бігової доріжки - рездор",
      metrics: "вид хронометражу - електронний",
    },
    tables: [
      {
        head: {
          number: "Номер",
          team: "Команда",
          initials: "Імя та призвіще",
          bday: "Рік народження",
          result: "Результат",
          sum: "Сума часу",
          category: "Розряд",
          before: "before",
          after: "after",
        },
        rows: Array(15).fill({
          number: "2",
          team: {
            name: "Чернівецька область",
            others: "поза заліком",
            participants: [
              {
                initials: "Наталія Крепінка",
                bday: "1999",
                result1: "7,72",
                result2: "7,75",
                before: "before",
                after: "after",
              },
              {
                initials: "Наталія TT",
                bday: "1998",
                result1: "7,72",
                result2: "7,75",
                before: "before",
                after: "after",
              },
            ],
            excluded: [
              {
                initials: "Наталія поза заліком",
                bday: "1995",
                result1: "7,72",
                result2: "XXX",
                before: "before",
                after: "after",
              },
            ],
          },
        }),
      },
    ],
    judges: [
      {
        title: "Головний суддя змаганнь, \nсуддя міжнародної категорії",
        name: "Ігор Ущапівський",
      },
      {
        title: `Головний секретар змаганнь, \nсуддя міжнародної категорії`,
        name: "Зіновій Карапінка",
      },
      {
        title: `Старший суддя, \nсуддя міжнародної категорії`,
        name: "Володимир Новгородченко",
      },
    ],
  },
  {
    type: "DUELING_PERSONAL_RESULTS",
    header: {
      headerLine:
        "Міністерство молоді та спорту України \n Федерація пожежно-прикладного спорту України",
      subLine: "Чемпіонат України з пожежно-прикладного спорту жінки III ранг",
      protocolLine: "Протокол",
      subProtocolLine: "Особистих результатів у двоборстві",
      date: "20 червня 2023 року",
      location: "м. Івано-Франківськ",
      track: "покриття бігової доріжки - рездор",
      metrics: "вид хронометражу - електронний",
    },
    tables: [
      {
        head: {
          location: "Місце",
          number: "№ Учасника",
          initials: "Імя та призвіще",
          bday: "Рік народження",
          team: "Команда",
          columns: ["100м смуга", "штурмова драбина", "сума часу"],
        },
        rows: Array(35).fill({
          location: "1",
          number: "2",
          initials: "Bobby here and there",
          bday: "1993",
          team: "Some team",
          columns: ["55.2", "33.22", "44.2"],
        }),
      },
    ],
    judges: [
      {
        title: "Головний суддя змаганнь, \nсуддя міжнародної категорії",
        name: "Ігор Ущапівський",
      },
      {
        title: `Головний секретар змаганнь, \nсуддя міжнародної категорії`,
        name: "Зіновій Карапінка",
      },
      {
        title: `Старший суддя, \nсуддя міжнародної категорії`,
        name: "Павло Скуба",
      },
    ],
  },
  {
    type: "TEAM_RESULTS_BY_TYPE",
    header: {
      headerLine:
        "Міністерство молоді та спорту України \n Федерація пожежно-прикладного спорту України",
      subLine: "Чемпіонат України з пожежно-прикладного спорту жінки III ранг",
      protocolLine: "Протокол",
      subProtocolLine: "Командних результатів у двоборстві",
      date: "20-21 червня 2023 року",
      location: "м. Івано-Франківськ",
      track: "покриття бігової доріжки - рездор",
      metrics: "вид хронометражу - електронний",
    },
    tables: [
      {
        head: {
          number: "Номер",
          team: "Команда",
          initials: "Імя та призвіще",
          bday: "Рік народження",
          result: "Результат",
          sum: "Сума часу",
        },
        rows: Array(15).fill({
          number: "2",
          team: {
            name: "Чернівецька область",
            others: "поза заліком",
            participants: [
              {
                initials: "Наталія Крепінка",
                bday: "1999",
                result1: "7,72",
                result2: "7,75",
              },
              {
                initials: "Наталія TT",
                bday: "1998",
                result1: "7,72",
                result2: "7,75",
              },
            ],
            excluded: [
              {
                initials: "Наталія поза заліком",
                bday: "1995",
                result1: "7,72",
                result2: "XXX",
              },
            ],
          },
        }),
      },
    ],
    judges: [
      {
        title: "Головний суддя змаганнь, \nсуддя міжнародної категорії",
        name: "Ігор Ущапівський",
      },
      {
        title: `Головний секретар змаганнь, \nсуддя міжнародної категорії`,
        name: "Зіновій Карапінка",
      },
      {
        title: `Старший суддя, \nсуддя міжнародної категорії`,
        name: "Володимир Новгородченко",
      },
    ],
  },
  {
    type: "TEAM_RELAY_RESULTS",
    header: {
      headerLine:
        "Міністерство молоді та спорту України \n Федерація пожежно-прикладного спорту України",
      subLine: "Чемпіонат України з пожежно-прикладного спорту жінки III ранг",
      protocolLine: "Протокол",
      subProtocolLine:
        "Командних результатів з пожежної естафети 4 х 100 метрів",
      date: "22 червня 2023 року",
      location: "м. Івано-Франківськ",
      track: "покриття бігової доріжки - рездор",
      metrics: "вид хронометражу - електронний",
    },
    tables: [
      {
        head: {
          location: "Місце",
          team: "Команда",
          number: "№ Учасника",
          initials: "Імя та призвіще",
          bday: "Рік народження",
          first: "Перша спроба",
          second: "Друга спроба",
          final: "Кращий",
        },
        rows: Array(9).fill({
          location: "1",
          team: "Чернівецька область",
          first: "88",
          second: "86",
          final: "88",
          participants: [
            {
              number: "2",
              initials: "Наталія Крепінка df sdf sdfsd",
              bday: "1999",
            },
            {
              number: "3",
              initials: "Наталія GG",
              bday: "1996",
            },
            {
              number: "4",
              initials: "Наталія TT",
              bday: "1997",
            },
            {
              number: "5",
              initials: "Наталія VV",
              bday: "1995",
            },
          ],
        }),
      },
    ],
    judges: [
      {
        title: "Головний суддя змаганнь, \nсуддя міжнародної категорії",
        name: "Ігор Ущапівський",
      },
      {
        title: `Головний секретар змаганнь, \nсуддя міжнародної категорії`,
        name: "Зіновій Карапінка",
      },
      {
        title: `Старший суддя, \nсуддя національної категорії`,
        name: "Іван Мовчан",
      },
    ],
  },
  {
    type: "START_PROTOCOL",
    header: {
      headerLine:
        "Міністерство молоді та спорту України \n Федерація пожежно-прикладного спорту України",
      subLine: "Чемпіонат України з пожежно-прикладного спорту жінки III ранг",
      protocolLine: "Стартовий протокол",
      subProtocolLine: "змаганнь з чогось там",
      date: "22 червня 2023 року",
      location: "м. Івано-Франківськ",
      track: "покриття бігової доріжки - рездор",
      metrics: "вид хронометражу - електронний",
    },
    tables: [
      {
        head: {
          set: "№ забігу",
          track: "№ доріжки",
          team: "Найменування команди",
          number: "№ Учасника",
          initials: "Імя та призвіще",
          bday: "Рік народження",
          category: "Спорт. розряд / \n звання",
          first: "Перша спроба",
          second: "Друга спроба",
          final: "Кращий",
        },
        rows: Array(9).fill({
          set: "1",
          participants: [
            {
              track: "1",
              number: "2",
              initials: "Наталія Крепінка df sdf sdfsd",
              bday: "1999",
              team: "Чернівецька область",
              category: "I",
            },
            {
              track: "2",
              number: "3",
              initials: "Наталія GG",
              bday: "1996",
              team: "Чернівецька область",
              category: "I",
            },
            {
              track: "3",
              number: "4",
              initials: "Наталія TT",
              bday: "1997",
              team: "Чернівецька область",
              category: "I",
            },
            {
              track: "4",
              number: "5",
              initials: "Наталія VV",
              bday: "1995",
              team: "Чернівецька область",
              category: "I",
            },
          ],
        }),
      },
    ],
    judges: [
      {
        title: "Головний суддя змаганнь, \nсуддя міжнародної категорії",
        name: "Ігор Ущапівський",
      },
      {
        title: `Головний секретар змаганнь, \nсуддя міжнародної категорії`,
        name: "Зіновій Карапінка",
      },
      {
        title: `Старший суддя, \nсуддя національної категорії`,
        name: "Іван Мовчан",
      },
    ],
  },
];
